import React from "react";

const PaneerTikkaRecipe = () => {
  return (
    <div>
      <h2>पनीर टिक्का रेसिपी:</h2>
      <ol>
        <li>500 ग्राम पनीर (कटा हुआ)</li>
        <li>1 कप दही</li>
        <li>1 छोटा कटा हुआ प्याज</li>
        <li>1 छोटा कटा हुआ टमाटर</li>
        <li>1/2 कप हरा धनिया (बारीक कटा हुआ)</li>
        <li>1 छोटी कटी हुई हरी मिर्च</li>
        <li>1 टेबलस्पून लाल मिर्च पाउडर</li>
        <li>1 टेबलस्पून गरम मसाला</li>
        <li>1 टेबलस्पून अदरक-लहसुन का पेस्ट</li>
        <li>नमक स्वादानुसार</li>
        <li>तेल तलने के लिए</li>
      </ol>
      <p><strong>तैयारी की प्रक्रिया:</strong></p>
      <ol>
        <li>पनीर को धोकर छोटे टुकड़ों में काट लें।</li>
        <li>एक बड़े बाउल में दही, प्याज, टमाटर, हरा धनिया, हरी मिर्च, लाल मिर्च पाउडर, गरम मसाला, अदरक-लहसुन का पेस्ट, और नमक मिलाकर मिलाएं।</li>
        <li>पनीर के टुकड़े इस मिश्रण में मिलाकर अच्छे से मिलाएं और 2 घंटे के लिए मरीनेट करें।</li>
        <li>तवे पर तेल गरम करें और मरिनेट किए हुए पनीर टुकड़ों को सुनहरी रंग तक शान्त करें।</li>
        <li>गरमा गरम पनीर टिक्का चटनी के साथ परोसें।</li>
      </ol>
    </div>
  );
};

const Pure_componant = () => {
  return (
    <>
      <PaneerTikkaRecipe />
    </>
  );
};

export default Pure_componant;
